ci4/app/Models/ArtikelModel.php

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
---
    public function getArtikelDenganKategori($id_kategori = null)
    {
        $builder = $this->select('artikel.*, kategori.nama_kategori')
                        ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($id_kategori !== null) {
            $builder->where('artikel.id_kategori', $id_kategori);
        }

        return $builder->findAll(); // hasil berupa array asosiatif