ci4/app/Controllers/Artikel.php

        'title'   => $title,
        'q'       => $q,
        'selectedKategori' => $kategoriId,
        'kategori' => (new KategoriModel())->findAll(),
---
SELECT *
FROM `kategori`